{
  "lessons": {
    "figma": {
      "first": {
        "title": "Знакомство с программой",
        "video": "https://www.youtube.com/embed/x9GYVG4EJYs",
        "paragraf_1": "<b>Фигма (Figma)</b> — это облачный инструмент для дизайна интерфейсов и прототипирования, который стал популярным среди UI/UX-дизайнеров благодаря своей простоте, функциональности и возможностям для совместной работы.<p> Вот основные особенности Figma: </p><p><b>1</b> Редактирование в реальном времени: </p><p>Несколько пользователей могут работать над одним файлом одновременно, что идеально подходит для командной работы. </p><p>Можно оставлять комментарии и feedback прямо в проекте. </p><p><b>2 </b>Облачная платформа: </p><p>Все файлы хранятся в облаке, поэтому доступ к ним можно получить с любого устройства с интернетом. </p><p>Нет необходимости вручную управлять версиями файлов. </p><p><b>3</b> Кроссплатформенность: </p><p>Работает на Windows, macOS и Linux через браузер или десктопное приложение.",
        "paragraf_2": "Дизайн и прототипирование:Можно создавать как статичные дизайны, так и интерактивные прототипы с анимациями и переходами.Компоненты и стили:Возможность создавать переиспользуемые компоненты (например, кнопки, иконки) и стили (цвета, шрифты), что обеспечивает единообразие дизайна.Изменения в основном компоненте автоматически применяются ко всем его копиям.Плагины и интеграции:Большая библиотека плагинов для расширения функциональности (иконки, графики, проверка доступности).Интеграция с такими инструментами, как Slack, Jira, Zeplin.Передача разработчикам:Разработчики могут просматривать дизайн, получать CSS-код и экспортировать ресурсы прямо из Figma.Бесплатный и платный тарифы:Бесплатный тариф для индивидуальных пользователей с ограниченным количеством проектов.Платные тарифы (Professional и Organization) предлагают дополнительные функции, такие как расширенное управление командами и проектами.",
        "paragraf_3": "Преимущества Figma:Доступность: Бесплатный тариф подходит для большинства индивидуальных дизайнеров.Удобство: Все в одном месте — от дизайна до прототипов и передачи разработчикам.Скорость: Облачная платформа позволяет быстро начать работу без установки дополнительного ПО.Недостатки:Зависимость от интернета: Для работы требуется стабильное интернет-соединение.Ограничения бесплатного тарифа: Для больших команд или проектов может потребоваться платный тариф."
      }
    }
  }
}
